[
    {
    "recipeName": "Grandma's Rock Buns",
    "recipeNameCode": "grandmasRockBuns",
    "recipeAuthor": "Daniel Gallichan",
    "authorUniSchool": "School of Engineering",
    "recipeType": "Snack / cake",
    "recipeSuitability": ["Vegetarian"],
    "recipeCulture": "UK / Ireland",
    "ingredients": [
        "90g margarine or butter",
        "90g granulated sugar",
        "250g self-raising flour",
        "30g finely chopped mixed peel",
        "1 egg (+ some milk if needed)"
    ],
    "method": "Put the flour and sugar into a mixing bowl and use your fingertips to rub in the butter (or margarine) until the mixture resembles fine breadcrumbs. Add the egg and use a fork to mix in until the dough sticks together and lumps will just slowly drop off the fork (add milk if too try, add flour if too wet). Divide into eight rough lumps (rocks!) on a greased baking tray and bake at 220 degrees C (200 degrees C for fan oven) for around 15 minutes until golden brown on top. They will be soft to the touch until they cool down and develop their rocky crust.",
    "numberServed": 8,
    "prepTime": 20,
    "cookTime": 15,
    "recipeCostLevel": 1,
    "unusualIngredients": "'Mixed peel' isn't something I had needed to buy before, but can usually be found alongside raisins/sultanas in the supermarket baking aisle.",
    "recipeStory": "My Grandma's rock buns (some people call them 'rock cakes' apparently, but to us they were definitely always 'buns'!) were a staple treat of my childhood - and also whenever in adulthood I would visit my Grandma in Cornwall these were often served alongside a cup of tea to welcome her guests. I'm reasonably sure that my Grandad would have had one of these every day for his 'elevenses' (usually quite a bit earlier than 11am I think though...) for around 40 years or so! </p><p> One of my cousins was wise enough to get Grandma to write down all her best recipes a few years back (including of course her recipe for Cornish pasties - but I thought that might be a bigger challenge for me to try to bake for the first time to submit for this book!) and the recipes were all shared with the family around the time of Grandma's funeral last year. This book got me to try to bake rock buns for the first time in my life - and it was even easier than I was expecting, and *almost* as delicious as those my Grandma used to make. I encourage you to give it a go yourself, and enjoy alongside a nice cup of tea or coffee.",
    "imageFile": "grandmasRockBuns.jpg"
    }
]